docs/code-graphs/internal-crate-deps.dot
digraph workspace_crates {
    rankdir=LR;
    node [shape=box, style="rounded"];
    "algebra";
    "box-ffi";
    "boxes";
    "codegen";
    "compiler";
    "cranelift-ffi";
    "doc";
    "draw";
    "errors";
    "eval";
    "faust-ffi";
    "fir";
    "foreign-call";
    "graph";
    "interp-ffi";
    "interval";
    "normalize";
    "parser";
    "propagate";
    "signals";
    "sigtype";
    "tlib";
    "transform";
    "ui";
    "utils";
    "wasm-ffi";
    "xtask";
    "box-ffi" -> "boxes";
    "box-ffi" -> "codegen";
    "box-ffi" -> "compiler";
    "box-ffi" -> "fir";
    "box-ffi" -> "propagate";
    "box-ffi" -> "tlib";
    "box-ffi" -> "transform";
    "box-ffi" -> "ui";
    "box-ffi" -> "utils";
    "boxes" -> "tlib";
    "codegen" -> "fir";
    "codegen" -> "foreign-call";
    "compiler" -> "boxes";
    "compiler" -> "codegen";
    "compiler" -> "draw";
    "compiler" -> "errors";
    "compiler" -> "eval";
    "compiler" -> "fir";
    "compiler" -> "parser";
    "compiler" -> "propagate";
    "compiler" -> "signals";
    "compiler" -> "sigtype";
    "compiler" -> "tlib";
    "compiler" -> "transform";
    "compiler" -> "ui";
    "cranelift-ffi" -> "box-ffi";
    "cranelift-ffi" -> "codegen";
    "cranelift-ffi" -> "compiler";
    "cranelift-ffi" -> "fir";
    "cranelift-ffi" -> "interp-ffi";
    "cranelift-ffi" -> "utils";
    "draw" -> "boxes";
    "draw" -> "tlib";
    "eval" -> "boxes";
    "eval" -> "errors";
    "eval" -> "normalize";
    "eval" -> "parser";
    "eval" -> "propagate";
    "eval" -> "signals";
    "eval" -> "tlib";
    "faust-ffi" -> "box-ffi";
    "faust-ffi" -> "cranelift-ffi";
    "faust-ffi" -> "interp-ffi";
    "fir" -> "tlib";
    "interp-ffi" -> "codegen";
    "interp-ffi" -> "compiler";
    "interp-ffi" -> "utils";
    "normalize" -> "interval";
    "normalize" -> "signals";
    "normalize" -> "sigtype";
    "normalize" -> "tlib";
    "normalize" -> "ui";
    "parser" -> "boxes";
    "parser" -> "errors";
    "parser" -> "tlib";
    "propagate" -> "boxes";
    "propagate" -> "errors";
    "propagate" -> "signals";
    "propagate" -> "tlib";
    "propagate" -> "ui";
    "signals" -> "tlib";
    "signals" -> "ui";
    "sigtype" -> "interval";
    "sigtype" -> "signals";
    "sigtype" -> "tlib";
    "sigtype" -> "ui";
    "transform" -> "fir";
    "transform" -> "normalize";
    "transform" -> "signals";
    "transform" -> "sigtype";
    "transform" -> "tlib";
    "transform" -> "ui";
    "ui" -> "tlib";
    "wasm-ffi" -> "codegen";
    "wasm-ffi" -> "compiler";
    "wasm-ffi" -> "parser";
    "wasm-ffi" -> "utils";
    "xtask" -> "codegen";
    "xtask" -> "compiler";
    "xtask" -> "fir";
}
